app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
#debugger
	columns = {'title' => 'title', 'release_date' => 'release_date'}
        if columns.has_key?(@sort)
	  query = Movie.order(columns[@sort])